# -*- coding:gbk -*-
"""
黑龙江省金保工程一体化，社保模块
23030111 鸡西市社会保险事业中心（养老保险）
23002311 鸡西市社会保险事业中心（中直鸡西矿区养老保险）
"""
import requests


class SB:

    def __init__(self) -> None:
        pass
    

    def dyff_info(self):
        # 待遇发放明细查询
        url = 'http://10.64.2.100:30010/business/m0027/EntryDatagrid'
        data = {
            "aac002": "23030419730102402X",     # 社会保障号
            "aae041": "202402",                 # 开始年月
            "aae042": "202405",                 # 终止年月
            "aac001": ""                        # 个人编号
            # "page": 1,
            # "rows": 10
        }
        pass
        row = {
            "aac002": "23030419730102402X",     # 社会保障号
            "aac003": "刘艳春",                 # 姓名
            "aae002": 202405,                   # 费款所属期
            "aae010": "6217565300004935958",    # 银行账号
            "aae019": 1931.27,                  # 金额
            "aae117": "支付成功"                # 发放标识
        }

    def rycb_info(self):
        # 人员参保信息查询
        url = 'http://10.64.2.100:30010/business/m5906/entry21'
        data = {
            "aac001": 2,                        # 个人编号
            "aab001": 1,                        # 单位编号
            "aae140": "",                       # 险种
            "aac002": "23030419730102402X",     # 社会保障号
        }
        
        row = {
            "aab001": "23039923030111105177",   # 单位编号
            "aab004": "大商股份鸡西新玛特广益街购物广场有限公司",   # 单位名称
            "aab034": "23030111",               # 机构编号
            "aac001": "2303000314840",          # 个人编号
            "aac002": "23030419730102402X",     # 社会保障号
            "aac003": "刘艳春",                 # 姓名
            "aac008": "正常参保",
            "aac013": "订立固定期限劳动合同",
            "aac030": "19930901",               # 人员参保日期
            "aac031": "终止缴费",                # 人员缴费状态
            "aac049": "199309",
            "aac066": "企业职工",
            "aac084": "是",                     # 退休状态
            "aac313": "230101",
            "aac314": "企业职工",                   # 参保身份
            "aae041": "199309",     
            "aae100": "有效",                      # 有效标识
            "aae140": "企业职工基本养老保险",       # 险种类型
            "aae140value": "110",                 # 险种类型
            "aae206": "",
            "aae868": "",
            "aaz159": "23202001010300314840",     # 人员参保关系ID
            "ajc054": "",                         # 结转未计发待遇的累计缴费月数
            "ajc055": ""                          # 结转剩余可享受失业保险待遇月数
        }

    def rysj_info(self):
        # 人员实缴信息查询
        url = 'http://10.64.2.100:30010/business/m5908/entry21'
        data = {
            "aac001": "1",                       # 个人编号
            "aac002": "23030419730102402X",      # 社会保障号
            "aab001": "2",                       # 单位编号
            "aae042": 202202,                    # 终止年月
            "aae041": 202201                     # 开始年月
        }

        row = {
            "aaa115": "正常应缴",               # 缴费类型
            "aab001": "23039923030111105177",   # 单位编号
            "aab004": "大商股份鸡西新玛特广益街购物广场有限公司",   # 单位名称
            "aab191": "20220121",               # 到账日期
            "aac001": "2303000314840",          # 个人编号
            "aac002": "23030419730102402X",     # 身份证号
            "aac003": "刘艳春",                 # 姓名
            "aac066": "企业职工",               # 参保身份
            "aae002": "202201",                 # 对应费款所属期
            "aae003": "202201",                 # 对应费款所属期
            "aae080": "563.04",             # 单位实缴金额
            "aae081": "0",                  # 单位实缴划入个人账户金额
            "aae082": "281.52",             # 个人实缴金额
            "aae083": "281.52",             # 个人实缴划入个人账户金额
            "aae180": "3519",               # 人员缴费基数
            "aae741": "迁移历史核定数据",    # 数据来源
            "aae788": "0",                  # 单位实缴金额利息
            "aae789": "0",                  # 个人实缴金额利息
            "aae790": "0",                  # 单位实缴划入个人账户金额利息
            "aae791": "0",                  # 个人实缴划入个人账户金额利息
            "aae792": "正常",               # 费用标志
            "aaz223": "23000000001984560525"
        }

    def dqdy_info(self):
        # 定期待遇信息查询
        url = 'http://10.64.2.100:30010/business/m5914/Entry21'
        url2 = 'http://10.64.2.100:30010/business/m5914/entryOne'
        data = {
            "aac001": "",                       # 个人编号
            "aac002": "23030419730102402X"      # 社会保障号
        }
        data2 = {
            "aac001": "",
            "aac002": "23030419730102402X"%20,
            "page": 1%20,
            "rows": 10,
        }

        row = {
            "aaa036": "基础养老金（2006年1月1日后退休人员享受）",       # 待遇项目代码
            "aaa509": "",                          # 政策文件
            "aac001": "2303000314840",              # 个人编号
            "aac002": "23030419730102402X",         # 身份证号
            "aac003": "刘艳春",                     # 姓名
            "aac004": "女",                         # 性别
            "aac005": "汉族",                       # 民族
            "aac006": "19730102",                   # 出生年月日
            "aac084": "20230101",                   # 
            "aae019": "1565.61",                   # 待遇金额
            "aae041": "202302",                   # 开始年月
        }

    def dyff_info(self):
        # 待遇发放信息查询
        url = 'http://10.64.2.100:30010/business/m5918/entrydatagrid'
        data = {
            "aac001": "2303000314840",      # 个人编号
            "aac002": ""                    # 社会保障号
        }

        row = {
            "aaa103": "中国银行-社保卡发放",      # 银行编号
            "aac001": "2303000314840",          # 个人编号
            "aae008": "0101",
            "aae009": "刘艳春",                 # 银行户名
            "aae010": "6217565300004935958",    # 银行账号
            "aaf200": "中国银行",
            "aaf216": "中国银行",               # 银行行别代码
            "aaf217": "中国银行",               # 地方银行名称
        }

    def rzxx_info(self):
        # 认证信息查询
        url = 'http://10.64.2.100:30010/business/m5919/entrydatagrid'
        data = {
            "aae041": "2024-01-01",             # 认证开始年月
            "aae042": "2024-08-19",             # 认证终止年月
            "aac001": "",                       # 个人编号
            "aac002": "23030419730102402X",     # 社会保障号
            "aaa135": ""                        # 认证方式
        }

        row = {
            "aaa135": "人脸认证",               # 认证方式
            "aac001": "2303000314840",          # 个人编号
            "aac002": "23030419730102402X",     # 社会保障号
            "aac003": "刘艳春",                 # 姓名
            "aae001": "2024",                   # 年份？
            "aae005": "13836507204",            # 联系电话
            "aae006": "黑龙江省鸡西滴道区同乐九组团1-3-601",        # 地址
            "aae041": "202403",                 # 最后认证开始年月
            "aae042": "202502",                 # ？
            "aae116": "正常发放",               # 待遇发放状态
            "aae140": "企业职工基本养老保险",    # 险种？
            "aae230": "20240320",               # 认证日期
            "aaz257": "23230119110126006226"
        }

    def ryzh_info(self):
        # 人员账户查询
        url = 'http://10.64.2.100:30010/business/m5924/queryPersonInfo'
        data = {
            "queryParams[aac001]": "",                          # 个人编号
            "queryParams[aac002]": "230304199812134414",        # 社会保障号
            "queryParams[aac003]": "",                          # 姓名
            "queryParams[aab001]": "",                          # 单位编号
            "queryParams[sa0200]": 111592421,
            "timeout": 1000000,
            "page": 1,
            "rows": 20
        }

        row = {
            "AAA027": "230399",
            "AAA350": 23240418153534464000,
            "AAA431": "0",
            "AAA508": "dmVyOjEuMA==.YWFhMzUwLGFhYTUwOA==.GAlzVd9CvmiosPnK/yNTexm6ccLAtzUD11H+PJ5oFqo=",
            "AAB001": 23039923030111110000,
            "AAB034": "23030111",
            "AAB359": "230399",
            "AAB360": "230399",
            "AAC001": "2303203415708",          # 人员编号
            "AAC002": "230304199812134414",     # 公民身份号码
            "AAC003": "高升",                   # 姓名
            "AAC004": "1",
            "AAC005": "01",
            "AAC006": 19981213,
            "AAC008": "1",
            "AAC013": "41",
            "AAC030": "20240401",               # 个人参保日期
            "AAC031": "1",
            "AAC031Name": "参保缴费",           # 人员缴费状态
            "AAC040": 1610,
            "AAC049": "202111",                 # 首次参保年月
            "AAC058": "01",
            "AAC066": "101",
            "AAC066Name": "企业职工",           # 人员参保状态
            "AAC147": "230304199812134414",
            "AAC313": "101",
            "AAC314": "企业职工",               # 人员参保状态
            "AAE011": "孙赢",
            "AAE036": 20240813102228,
            "AAE041": 202404,
            "AAE100": "1",
            "AAE140": "110",
            "AAE180": 4206,
            "AAE206": 202404,
            "AAE859": 20240418153534,
            "AAE860": "鲍安娜",
            "AAF018": "230000",
            "AAZ159": "23240418153534465711",
            "AAZ649": 2408131022265628,
            "AAZ673": 0,
            "AAZ692": "0301110113"
        }
        url2 = 'http://10.64.2.100:30010/business/m5924/entry'
        data2 = {
            "aac001": "2303203415708",
            "aaz159": "23240418153534465711"
        }
        url3 = 'http://10.64.2.100:30010/business/m5924/queryAccount'
        data3 = {
            "queryParams[aac001]": "2303203415708",
            "queryParams[aaz159]": "23240418153534465711",
            "timeout": 1000000
        }

    def ywbl_info(self):
        # 业务办理查询
        url = 'http://10.64.2.100:30010/business/m0001/entryDatagrid'
        url = 'http://10.64.2.100:30010/business/m0001/entryDatagrid'
        data = {
            "sa0200": "",
            "da0001": "",
            "applyID": "230304199812134414",    # 社会保障号
            "applyName": "",
            "aae041": "20220801",               # 开始日期
            "aae042": "20240819",               # 终止日期
            "ua0100": "",
            "aab001": "",                       # 单位编号
            "aab004": ""                        # 单位名称
        }

        row = {
            "aab001": "23030123030114679143",   # 单位编号
            "aab004": "鸡西市滴道区人力资源和社会保障服务中心（基层平台协理员）",   # 单位名称
            "aae930": "2024年03月21日13:29:44",     # 经办时间
            "aae931": "2024年03月21日16:20:12",     # 审核时间
            "ae0202": "",                       # 经办结果说明
            "applyID": "230304199812134414",    # 申请人编码
            "applyName": "高升",                # 申请人名称
            "da0000": "2403211329444901",       # 业务主键ID
            "da0001": "400",                    # 业务办理状态
            "da0001Name": "完成",               # 业务办理状态
            "da0005": "公共服务受理平台",       # 来源
            "sa0200": "111210121",
            "sa0201": "在职职工参保办理",       # 业务名称
            "ua0100": "周莹莹",                 # 经办人
            "ua0100Audit": "王霁虹"             # 审核人
        }
        pic_url = 'http://10.64.2.100:30010/download/FB1_65fbc4b056665b4c4602fbbd'
        xq_url = 'http://10.64.2.100:30010/business/m0001/detailView'
        data2 = {
            "sa0200": "111210121",
            "da0000": "2403211329444901",
            "taskId": "null"
        }